app/Config/Email.php

SELECT *
FROM `email`
---
    public function __construct()
    {
        $model = new M_Email();
        $settings = $model->findAll();