app/Controllers/Emailsetting.php

    public function index()
    {
        $isLoggedIn = session('log');
        $userRole = session()->get('level');

        if (!$isLoggedIn || $userRole !== 'Admin') {
            // Jika pengguna tidak terautentikasi atau bukan Admin, redirect ke halaman lain
            return redirect()->to(base_url('home'));
        }
        $model = $this->M_Email;
        $settings = $model->findAll();
---
SELECT *
FROM `email`