app/Controllers/Home.php

SELECT *
FROM `infopublik`
JOIN `instansi` ON `instansi`.`id_int` = `infopublik`.`id_int`
ORDER BY `id_info` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `infopublik`
JOIN `instansi` ON `instansi`.`id_int` = `infopublik`.`id_int`
---
   public function index()
   {
      $currentpage = $this->request->getVar('page_infopublik') ? $this->request->getVar('page_infopublik') : 1;
      $keyword = $this->request->getVar('keyword');
      if ($keyword) {
         $infopublik = $this->M_Home->search($keyword);
      } else {
         $infopublik = $this->M_Home;
      }

      $data = [
         'title' => 'Infopublik',
         'opd' => $this->M_Home->selectinstansi(),
         'infopublik' => $infopublik->join('instansi', 'instansi.id_int = infopublik.id_int')->orderBy('id_info', 'DESC')->paginate(10, 'infopublik'),
         'pager' => $this->M_Home->pager,
         'currentpage' => $currentpage,
         'isi'   => 'admin/infopublik'
      ];

SELECT *
FROM `regulasi`
ORDER BY `id_reg` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `regulasi`
---
   public function regulasi()
   {
      $currentpage = $this->request->getVar('page_reg') ? $this->request->getVar('page_reg') : 1;
      $keyword = $this->request->getVar('keyword');
      if ($keyword) {
         $reg = $this->M_Regulasidata->search($keyword);
      } else {
         $reg = $this->M_Regulasidata;
      }

      $data = [
         'title' => 'Regulasi Data',
         'regulasidata' => $reg->orderBy('id_reg', 'DESC')->paginate(10, 'regulasidata'),

SELECT *
FROM `laporan`
ORDER BY `id_lap` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `laporan`
---
   public function laporan()
   {
      $currentpage = $this->request->getVar('page_lap') ? $this->request->getVar('page_lap') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $lap = $this->M_Laporandata->search($keyword);
        } else {
            $lap= $this->M_Laporandata;
        }

        $data = [
            'title' => 'Laporan Data',
            'laporandata' => $lap->orderBy('id_lap', 'DESC')->paginate(10, 'laporandata'),