app/Controllers/Kirimemail.php

SELECT *
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 2
AND `permohonan`.`solved` IS NULL
ORDER BY `id_pemohon` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 2
AND `permohonan`.`solved` IS NULL
---
    public function reply()
    {
        $currentpage = $this->request->getVar('page_permohonan') ? $this->request->getVar('page_permohonan') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $replytiket = $this->M_Permohonandata->search($keyword);
        } else {
            $replytiket = $this->M_Permohonandata;
        }

        $data = [
            'title' => 'Kirim Email',
            'replytiket' => $replytiket->join('instansi', 'instansi.id_int = permohonan.id_int')
                ->where('permohonan.status_tiket', 2)
                ->where('permohonan.solved', null)
                ->orderBy('id_pemohon', 'DESC')
                ->paginate(10, 'prosespermohonan'),