app/Controllers/Laporandata.php

SELECT *
FROM `laporan`
ORDER BY `id_lap` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `laporan`
---
    public function index()
    {
        $isLoggedIn = session('log');
        $userRole = session()->get('level');

        if (!$isLoggedIn || $userRole !== 'Admin') {
            // Jika pengguna tidak terautentikasi atau bukan Admin, redirect ke halaman lain
            return redirect()->to(base_url('home'));
        }
        $currentpage = $this->request->getVar('page_lap') ? $this->request->getVar('page_lap') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $lap = $this->M_Laporandata->search($keyword);
        } else {
            $lap= $this->M_Laporandata;
        }

        $data = [
            'title' => 'Laporan Data',
            'laporandata' => $lap->orderBy('id_lap', 'DESC')->paginate(10, 'laporandata'),