app/Controllers/Permohonandata.php

SELECT *
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
ORDER BY `id_pemohon` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
---
    public function index()
    {
        $currentpage = $this->request->getVar('page_perdata') ?: 1;
        $keyword = $this->request->getVar('keyword');
        $perdata = $this->M_Permohonandata;

        // Check if the session level is 'Operator' and add the condition
        if (session('level') === 'Operator') {
            $perdata->where('permohonan.id_int', session('id_int'));
        }

        if ($keyword) {
            $perdata = $perdata->search($keyword);
        }

        $data = [
            'title' => 'Permohonan data',
            'permohonandata' => $perdata->join('instansi', 'instansi.id_int = permohonan.id_int')
                ->orderBy('id_pemohon', 'DESC')
                ->paginate(10, 'permohonan'),
            'pager' => $this->M_Permohonandata->pager,
            'currentpage' => $currentpage,
            'isi' => 'admin/permohonandata'
        ];

SELECT *
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 1
ORDER BY `id_pemohon` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 1
---
    public function indexbaru()
    {
        $isLoggedIn = session('log');
        $userRole = session()->get('level');

        if (!$isLoggedIn || $userRole !== 'Admin') {
            // Jika pengguna tidak terautentikasi atau bukan Admin, redirect ke halaman lain
            return redirect()->to(base_url('home'));
        }
        $currentpage = $this->request->getVar('page_perbaru') ? $this->request->getVar('page_perbaru') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $perbaru = $this->M_Permohonandata->search($keyword);
        } else {
            $perbaru = $this->M_Permohonandata;
        }

        $data = [
            'title' => 'Permohonan data baru',
            'permohonanbaru' => $perbaru->join('instansi', 'instansi.id_int = permohonan.id_int')
                ->where('permohonan.status_tiket', 1)
                ->table('instansi')
                ->orderBy('id_pemohon', 'DESC')
                ->paginate(10, 'permohonanbaru'),
            'pager' => $this->M_Permohonandata->pager,
            'currentpage' => $currentpage,
            'isi'   => 'admin/permohonanbaru'
        ];

SELECT *
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 2
AND `permohonan`.`solved` IS NULL
ORDER BY `id_pemohon` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `permohonan`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 2
AND `permohonan`.`solved` IS NULL
---
    public function indexproses()
    {
        $currentpage = $this->request->getVar('page_perbaru') ? $this->request->getVar('page_perbaru') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $perbaru = $this->M_Permohonandata->search($keyword);
        } else {
            $perbaru = $this->M_Permohonandata;
        }

        // Check if the session level is 'Operator' and add the condition
        if (session('level') === 'Operator') {
            $perbaru->where('permohonan.id_int', session('id_int'));
        }

        $data = [
            'title' => 'Proses Permohonan Data',
            'proses_tiket' => $this->M_Prosespermohonan->getProses(),
            'prosespermohonan' => $perbaru->join('instansi', 'instansi.id_int = permohonan.id_int')
                ->where('permohonan.status_tiket', 2)
                ->where('permohonan.solved', null)
                ->orderBy('id_pemohon', 'DESC')
                ->paginate(10, 'prosespermohonan'),