app/Controllers/Sop.php

SELECT *
FROM `sop`
ORDER BY `id_sop` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `sop`
---
    public function index()
    {
        $currentpage = $this->request->getVar('page_Sop') ? $this->request->getVar('page_Sop') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $Sop = $this->M_Sop->search($keyword);
        } else {
            $Sop = $this->M_Sop;
        }

        $data = [
            'title' => 'Sop',
            'sop' => $Sop->orderBy('id_sop', 'DESC')->paginate(10, 'sop'),
            'pager' => $this->M_Sop->pager,
            'currentpage' => $currentpage,
            'isi'   => 'admin/sop'
        ];