app/Models/M_Home.php

    public function selectinstansi()
    {
        return $this->db->table('instansi')->get()->getResultArray();
---
SELECT *
FROM `instansi`