app/Models/M_Permohonan.php

SELECT *
FROM `instansi`
---
    public function selectinstansi()
    {
        return $this->db->table('instansi')->get()->getResultArray();

SELECT MAX(`id_pemohon`) AS `no_pemohonMax`
FROM `permohonan`
---
    public function generatetiket()
    {
        helper('number');
        $date     = date('dmy');
        $rno = rand(1, 999);
        $format     = "TKT$rno$date";
        $builder = $this->db->table('permohonan');
        $builder->selectMax('id_pemohon', 'no_pemohonMax');
        $query = $builder->get();

INSERT INTO `permohonan` (`no_tiket`, `nik`, `nama`, `alamat`, `kontak`, `pekerjaan`, `kategori`, `email`, `kebutuhan`, `tujuan`, `id_int`, `cara_info`, `dgn_cara`, `file`, `status_tiket`, `created_at`) VALUES ('TKT338040623009', '9171031312900001', 'KEN DIANTO', 'Jl. Hamadi Lapangan Gang Sayur Lilin', '081295975919', 'swasta', 'Instansi Pemerintahan', 'xflyxkie@gmail.com', 'sdasd', 'asdas', '2', '1', 'EMAIL', '506141.jpg', '0', '2023-06-04 19:16:32')
---
    public function kirimdata($data)
    {
        $this->db->table('permohonan')->insert($data);