app/Models/M_Prosespermohonan.php

    public function getProses()
    {
        return $this
            ->join('permohonan', 'permohonan.id_pemohon = prosestiket.id_pemohon')
            ->join('instansi', 'instansi.id_int = permohonan.id_int')
            ->where('permohonan.status_tiket', 2)
            ->where('permohonan.solved', null)
            ->orderBy('prosestiket.id_pemohon', 'DESC')
            ->findAll();
---
SELECT *
FROM `prosestiket`
JOIN `permohonan` ON `permohonan`.`id_pemohon` = `prosestiket`.`id_pemohon`
JOIN `instansi` ON `instansi`.`id_int` = `permohonan`.`id_int`
WHERE `permohonan`.`status_tiket` = 2
AND `permohonan`.`solved` IS NULL
ORDER BY `prosestiket`.`id_pemohon` DESC